import { CoffeeRounded, SchoolRounded, DataObjectRounded, DomainVerificationRounded } from "@mui/icons-material";

import avatar01 from "../assets/images/avatar-1.jpg";
import avatar02 from "../assets/images/avatar-2.jpg";
import avatar03 from "../assets/images/avatar-3.jpg";
import avatar04 from "../assets/images/avatar-4.jpg";
import avatar05 from "../assets/images/avatar-5.jpg";
import avatar06 from "../assets/images/avatar-6.jpg";

export const devWorkCount = [
    { title: "تعداد قهوه های خورده شده", icon: <CoffeeRounded d sx={{ fontSize: "4rem" }} />, total: 980, color: "primary.main" },
    { title: "تعداد دوره های من", icon: <SchoolRounded sx={{ fontSize: "4rem" }} />, total: 12, color: "whitesmoke" },
    { title: "تعداد پروژه های من", icon: <DataObjectRounded sx={{ fontSize: "4rem" }} />, total: 26, color: "whitesmoke" },
    { title: "تعداد پروژه های به پایان رسیده", icon: <DomainVerificationRounded sx={{ fontSize: "4rem" }} />, total: 14, color: "primary.main" }
]

export const devEdu = [
    {
        year: "1398 - 1398",
        cert: "دیپلم",
        major: "رشته کامپیوتر گرایش نرم افزار",
        uni: "فنی و حرفه ای هنرستان شهید قدمی"
    },
    {
        year: "1399 - 1401",
        cert: "کاردانی",
        major: "رشته کامپیوتر گرایش نرم افزار",
        uni: "دانشکده فنی و حرفه ای انقلاب اسلامی",
    },
    {
        year: "1401 - 1403",
        cert: "کارشناسی",
        major: "رشته کامپیوتر گرایش نرم افزار",
        uni: "دانشکده فنی و حرفه ای شمسی پور",
    },
]

export const devEXp = [
    {
        project: "پروژه تمرینی 1",
        year: "1399",
    },
    {
        project: "پروژه تمرینی 2",
        year: "1400",
    },
    {
        project: "پروژه نهایی دانشگاه",
        year: "1401",
    },

]

export const userComments = [
    {
        fullname: "یونس قربانی",
        jobTitle: "مدرس و برنامه نویس فول استک",
        avatar: avatar01,
        comment: `
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
              `,
    },
    {
        fullname: "یونس قربانی",
        jobTitle: "مدرس و برنامه نویس فول استک",
        avatar: avatar02,
        comment: `
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
              `,
    },
    {
        fullname: "یونس قربانی",
        jobTitle: "مدرس و برنامه نویس فول استک",
        avatar: avatar03,
        comment: `
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
              `,
    },
    {
        fullname: "یونس قربانی",
        jobTitle: "مدرس و برنامه نویس فول استک",
        avatar: avatar04,
        comment: `
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
              `,
    },
    {
        fullname: "یونس قربانی",
        jobTitle: "مدرس و برنامه نویس فول استک",
        avatar: avatar05,
        comment: `
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
              `,
    },
    {
        fullname: "یونس قربانی",
        jobTitle: "مدرس و برنامه نویس فول استک",
        avatar: avatar06,
        comment: `
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
              `,
    },
];
